app/views/beer_clubs/show.html.erb

    <% else %>
        <% @membership = Membership.find_by_user_id current_user.id %>
---
SELECT  "memberships".* FROM "memberships"  WHERE "memberships"."user_id" = 3 LIMIT 1