app/views/ratings/index.html.erb

SELECT "beers".* FROM "beers"   ORDER BY "beers"."average_rating" ASC
SELECT "ratings".* FROM "ratings"  WHERE "ratings"."beer_id" = ?  [["beer_id", 1]]
---
<h2>Best beers</h2>
    <% @beers = Beer.all.sort_by { |beer| beer.average_rating }.last(3) %>

SELECT "breweries".* FROM "breweries"
---
<h2>Best breweries</h2>
    <% @breweries = Brewery.all.sort_by { |brewery| brewery.average_rating }.last(3) %>

SELECT "styles".* FROM "styles"
---
<h2>Best styles</h2>
    <% @styles = Style.all.sort_by { |style| style.average_rating }.last(3) %>

SELECT "ratings".* FROM "ratings"  WHERE "ratings"."user_id" = ?  [["user_id", 1]]
SELECT "users".* FROM "users"
SELECT COUNT(*) FROM "ratings"  WHERE "ratings"."user_id" = ?  [["user_id", 1]]
---

      <% @users = User.all.sort_by { |user| user.ratings.count }.last(3) %>