app/controllers/beer_clubs_controller.rb

SELECT "beer_clubs".* FROM "beer_clubs"
---
  def index
    @beer_clubs = BeerClub.all

INSERT INTO "beer_clubs" ("city", "created_at", "founded", "name", "updated_at") VALUES (?, ?, ?, ?, ?)  [["city", "Heeee"], ["created_at", "2015-02-10 15:43:36.454767"], ["founded", 1999], ["name", "hahhahah"], ["updated_at", "2015-02-10 15:43:36.454767"]]
---
  def create
    @beer_club = BeerClub.new(beer_club_params)

    respond_to do |format|
      if @beer_club.save

SELECT  "beer_clubs".* FROM "beer_clubs"  WHERE "beer_clubs"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_beer_club
      @beer_club = BeerClub.find(params[:id])