app/controllers/beers_controller.rb

  def create
    @beer = Beer.new(beer_params)

    respond_to do |format|
      if @beer.save
---
INSERT INTO "beers" ("brewery_id", "created_at", "name", "style", "updated_at") VALUES (?, ?, ?, ?, ?)  [["brewery_id", 3], ["created_at", "2015-02-03 10:26:19.651650"], ["name", "Hoegarden"], ["style", "Weizen"], ["updated_at", "2015-02-03 10:26:19.651650"]]

  def set_breweries_and_styles_for_template
    @breweries = Brewery.all
---
SELECT "breweries".* FROM "breweries"